pftbest/msp430_svd/msp430-gcc-support-files/targetdb/Modules/msp430/eUSCI_A0_445.xml
    <register id="UCA0CTLW1" width="16" offset="0x2" internal="0" description="eUSCI_Ax Control Word Register 1">
        <bitfield id="UCGLIT" description="Deglitch time" begin="1" end="0" width="2" rwaccess="R/W">
            <bitenum id="UCGLIT_0" value="0x0" description="Approximately 2 ns (equivalent of 1 delay element)"/>
            <bitenum id="UCGLIT_1" value="0x1" description="Approximately 50 ns"/>
            <bitenum id="UCGLIT_2" value="0x2" description="Approximately 100 ns"/>
            <bitenum id="UCGLIT_3" value="0x3" description="Approximately 200 ns"/>
        </bitfield>
    </register>
    <register id="UCA0BRW" width="16" offset="0x6" internal="0" description="eUSCI_Ax Baud Rate Control Word Register">
    </register>
    <register id="UCA0BRW_SPI" width="16" offset="0x6" internal="0" description="eUSCI_Ax Bit Rate Control Register 1">
    </register>
    <register id="UCA0MCTLW" width="16" offset="0x8" internal="0" description="eUSCI_Ax Modulation Control Word Register">
        <bitfield id="UCOS16" description="Oversampling mode enabled" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="UCOS16_0" value="0x0" description="Disabled"/>
            <bitenum id="UCOS16_1" value="0x1" description="Enabled"/>
        </bitfield>
        <bitfield id="UCBRF" description="First modulation stage select" begin="7" end="4" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="UCBRS" description="Second modulation stage select" begin="15" end="8" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="UCA0STATW" width="16" offset="0xA" internal="0" description="eUSCI_Ax Status Register">
        <bitfield id="UCBUSY" description="eUSCI_A busy" begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="IDLE" value="0x0" description="eUSCI_A inactive"/>
            <bitenum id="BUSY" value="0x1" description="eUSCI_A transmitting or receiving"/>
        </bitfield>
        <bitfield id="UCADDR_UCIDLE" description="Address received / Idle line detected" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="UCADDR_UCIDLE_0" value="0x0" description="UCADDR: Received character is data. UCIDLE: No idle line detected"/>
            <bitenum id="UCADDR_UCIDLE_1" value="0x1" description="UCADDR: Received character is an address. UCIDLE: Idle line detected"/>
        </bitfield>
        <bitfield id="UCRXERR" description="Receive error flag" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="UCRXERR_0" value="0x0" description="No receive errors detected"/>
            <bitenum id="UCRXERR_1" value="0x1" description="Receive error detected"/>
        </bitfield>
        <bitfield id="UCBRK" description="Break detect flag" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="UCBRK_0" value="0x0" description="No break condition"/>
            <bitenum id="UCBRK_1" value="0x1" description="Break condition occurred"/>
        </bitfield>
        <bitfield id="UCPE" description="Parity error flag. When UCPEN = 0, UCPE is read as 0. UCPE is cleared when UCAxRXBUF is read." begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="UCPE_0" value="0x0" description="No error"/>
            <bitenum id="UCPE_1" value="0x1" description="Character received with parity error"/>
        </bitfield>
        <bitfield id="UCOE" description="Overrun error flag" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="UCOE_0" value="0x0" description="No error"/>
            <bitenum id="UCOE_1" value="0x1" description="Overrun error occurred"/>
        </bitfield>
        <bitfield id="UCFE" description="Framing error flag" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="UCFE_0" value="0x0" description="No error"/>
            <bitenum id="UCFE_1" value="0x1" description="Character received with low stop bit"/>
        </bitfield>
        <bitfield id="UCLISTEN" description="Listen enable" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="UCLISTEN_0" value="0x0" description="Disabled"/>
            <bitenum id="UCLISTEN_1" value="0x1" description="Enabled. UCAxTXD is internally fed back to the receiver"/>
        </bitfield>
    </register>
    <register id="UCA0STATW_SPI" width="16" offset="0xA" internal="0" description="">
        <bitfield id="UCOE" description="Overrun error flag" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="UCOE_0" value="0x0" description="No error"/>
            <bitenum id="UCOE_1" value="0x1" description="Overrun error occurred"/>
        </bitfield>
        <bitfield id="UCFE" description="Framing error flag" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="UCFE_0" value="0x0" description="No error"/>
            <bitenum id="UCFE_1" value="0x1" description="Bus conflict occurred"/>
        </bitfield>
        <bitfield id="UCLISTEN" description="Listen enable" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="UCLISTEN_0" value="0x0" description="Disabled"/>
            <bitenum id="UCLISTEN_1" value="0x1" description="Enabled. UCAxTXD is internally fed back to the receiver"/>
        </bitfield>
    </register>
    <register id="UCA0RXBUF" width="16" offset="0xC" internal="0" description="eUSCI_Ax Receive Buffer Register">
        <bitfield id="UCRXBUF" description="Receive data buffer" begin="7" end="0" width="8" rwaccess="R">
        </bitfield>
    </register>
    <register id="UCA0RXBUF_SPI" width="16" offset="0xC" internal="0" description="eUSCI_Ax Receive Buffer Register">
        <bitfield id="UCRXBUF" description="Receive data buffer" begin="7" end="0" width="8" rwaccess="R">
        </bitfield>
    </register>
    <register id="UCA0TXBUF" width="16" offset="0xE" internal="0" description="eUSCI_Ax Transmit Buffer Register">
        <bitfield id="UCTXBUF" description="Transmit data buffer" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="UCA0TXBUF_SPI" width="16" offset="0xE" internal="0" description="eUSCI_Ax Transmit Buffer Register">
        <bitfield id="UCTXBUF" description="Transmit data buffer" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="UCA0ABCTL" width="16" offset="0x10" internal="0" description="eUSCI_Ax Auto Baud Rate Control Register">
        <bitfield id="UCABDEN" description="Automatic baud-rate detect enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="UCABDEN_0" value="0x0" description="Baud-rate detection disabled. Length of break and synch field is not measured."/>
            <bitenum id="UCABDEN_1" value="0x1" description="Baud-rate detection enabled. Length of break and synch field is measured and baud-rate settings are changed accordingly."/>
        </bitfield>
        <bitfield id="UCBTOE" description="Break time out error" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="UCBTOE_0" value="0x0" description="No error"/>
            <bitenum id="UCBTOE_1" value="0x1" description="Length of break field exceeded 22 bit times"/>
        </bitfield>
        <bitfield id="UCSTOE" description="Synch field time out error" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="UCSTOE_0" value="0x0" description="No error"/>
            <bitenum id="UCSTOE_1" value="0x1" description="Length of synch field exceeded measurable time"/>
        </bitfield>
        <bitfield id="UCDELIM" description="Break/synch delimiter length" begin="5" end="4" width="2" rwaccess="R/W">
            <bitenum id="UCDELIM_0" value="0x0" description="1 bit time"/>
            <bitenum id="UCDELIM_1" value="0x1" description="2 bit times"/>
            <bitenum id="UCDELIM_2" value="0x2" description="3 bit times"/>
            <bitenum id="UCDELIM_3" value="0x3" description="4 bit times"/>
        </bitfield>
    </register>
    <register id="UCA0IRCTL" width="16" offset="0x12" internal="0" description="eUSCI_Ax IrDA Control Word Register">
        <bitfield id="UCIREN" description="IrDA encoder/decoder enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="UCIREN_0" value="0x0" description="IrDA encoder/decoder disabled"/>
            <bitenum id="UCIREN_1" value="0x1" description="IrDA encoder/decoder enabled"/>
        </bitfield>
        <bitfield id="UCIRTXCLK" description="IrDA transmit pulse clock select" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="UCIRTXCLK_0" value="0x0" description="BRCLK"/>
            <bitenum id="UCIRTXCLK_1" value="0x1" description="BITCLK16 when UCOS16 = 1. Otherwise, BRCLK."/>
        </bitfield>
        <bitfield id="UCIRTXPL" description="Transmit pulse length" begin="7" end="2" width="6" rwaccess="R/W">
        </bitfield>
        <bitfield id="UCIRRXFE" description="IrDA receive filter enabled" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="UCIRRXFE_0" value="0x0" description="Receive filter disabled"/>
            <bitenum id="UCIRRXFE_1" value="0x1" description="Receive filter enabled"/>
        </bitfield>
        <bitfield id="UCIRRXPL" description="IrDA receive input UCAxRXD polarity" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="HIGH" value="0x0" description="IrDA transceiver delivers a high pulse when a light pulse is seen"/>
            <bitenum id="LOW" value="0x1" description="IrDA transceiver delivers a low pulse when a light pulse is seen"/>
        </bitfield>
        <bitfield id="UCIRRXFL" description="Receive filter length" begin="15" end="10" width="6" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="UCA0IE" width="16" offset="0x1A" internal="0" description="eUSCI_Ax Interrupt Enable Register">
        <bitfield id="UCRXIE" description="Receive interrupt enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="UCRXIE_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="UCRXIE_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="UCTXIE" description="Transmit interrupt enable" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="UCTXIE_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="UCTXIE_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="UCSTTIE" description="Start bit interrupt enable" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="UCSTTIE_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="UCSTTIE_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="UCTXCPTIE" description="Transmit complete interrupt enable" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="UCTXCPTIE_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="UCTXCPTIE_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
    </register>
    <register id="UCA0IE_SPI" width="16" offset="0x1A" internal="0" description="eUSCI_Ax Interrupt Enable Register">
        <bitfield id="UCRXIE" description="Receive interrupt enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="UCRXIE_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="UCRXIE_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="UCTXIE" description="Transmit interrupt enable" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="UCTXIE_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="UCTXIE_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
    </register>
