pftbest/msp430_svd/msp430-gcc-support-files/targetdb/Modules/msp430/eUSCI_A0_445.xml
    <register id="UCA0IFG" width="16" offset="0x1C" internal="0" description="eUSCI_Ax Interrupt Flag Register">
        <bitfield id="UCRXIFG" description="Receive interrupt flag" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="UCRXIFG_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="UCRXIFG_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="UCTXIFG" description="Transmit interrupt flag" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="UCTXIFG_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="UCTXIFG_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="UCSTTIFG" description="Start bit interrupt flag" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="UCSTTIFG_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="UCSTTIFG_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="UCTXCPTIFG" description="Transmit ready interrupt enable" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="UCTXCPTIFG_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="UCTXCPTIFG_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
    </register>
    <register id="UCA0IFG_SPI" width="16" offset="0x1C" internal="0" description="eUSCI_Ax Interrupt Flag Register">
        <bitfield id="UCRXIFG" description="Receive interrupt flag" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="UCRXIFG_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="UCRXIFG_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="UCTXIFG" description="Transmit interrupt flag" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="UCTXIFG_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="UCTXIFG_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
    </register>
    <register id="UCA0IV" width="16" offset="0x1E" internal="0" description="eUSCI_Ax Interrupt Vector Register">
        <bitfield id="UCIV" description="eUSCI_A interrupt vector value" begin="15" end="0" width="16" rwaccess="R">
            <bitenum id="NONE" value="0x0" description="No interrupt pending"/>
            <bitenum id="UCRXIFG" value="0x2" description="Interrupt Source: Receive buffer full; Interrupt Flag: UCRXIFG; Interrupt Priority: Highest"/>
            <bitenum id="UCTXIFG" value="0x4" description="Interrupt Source: Transmit buffer empty; Interrupt Flag: UCTXIFG"/>
            <bitenum id="UCSTTIFG" value="0x6" description="Interrupt Source: Start bit received; Interrupt Flag: UCSTTIFG"/>
            <bitenum id="UCTXCPTIFG" value="0x8" description="Interrupt Source: Transmit complete; Interrupt Flag: UCTXCPTIFG; Interrupt Priority: Lowest"/>
        </bitfield>
    </register>
    <register id="UCA0IV_SPI" width="16" offset="0x1E" internal="0" description="eUSCI_Ax Interrupt Vector Register">
        <bitfield id="UCIV" description="eUSCI_A interrupt vector value" begin="15" end="0" width="16" rwaccess="R">
            <bitenum id="NONE" value="0x0" description="No interrupt pending"/>
            <bitenum id="UCRXIFG" value="0x2" description="Interrupt Source: Data received; Interrupt Flag: UCRXIFG; Interrupt Priority: Highest"/>
            <bitenum id="UCTXIFG" value="0x4" description="Interrupt Source: Transmit buffer empty; Interrupt Flag: UCTXIFG; Interrupt Priority: Lowest"/>
        </bitfield>
    </register>
</module>
